#pragma once
#include <iostream>
#include <string>
using namespace std;

void Show_Menu();//展示的函数
void exitSystem();//退出的函数


void Show_Menu()//展示的函数
{
	cout << "******************************************************" << endl;
	cout << "****欢迎使用英文二叉搜索树，请输入数字以执行操作：****" << endl;
	cout << "************* 1、请输入您要读入的文本文件   **********" << endl;
	cout << "************* 2、请输入停用词表或者停用词   **********" << endl;
	cout << "************* 3、继续输入文本文件           **********" << endl;
	cout << "************* 4、搜索单词及其出现次数       **********" << endl;
	cout << "************* 5、中序输出树以及打印树的模样 **********" << endl;
	cout << "************* 6、清空当前树                 **********" << endl;
	cout << "************* 0、退出系统		    **********" << endl;
	cout << "******************************************************" << endl;
	cout << "请输入您的选择:" << endl;
}

void exitSystem()//退出的函数
{
	cout << "欢迎下次使用" << endl;
	system("pause");
	exit(0);
}